#include "DRAWPRIMITIVE.H"
#include "GLOBAL.H"
#include "DELSTUFF.H"
#include "LARA.H"
#include "DOOR.H"
#include "HEALTH.H"
#include "CAMERA.H"
#include "DELTAPAK.H"
#include "GAME.H"
#include "EFFECTS.H"
#include "GAMEFLOW.H"
#include "DRAW.H"
#include "ITEMS.H"
#include "CONTROL.H"
#include "HWINSERT.H"
#include "SPOTCAM.H"
#include "TOMB4FX.H"
#include "EFFECT2.H"
#include "DIRECTX.H"
#include "OBJLIGHT.H"
#include "TEXTURE.H"
#include "DEBUG.H"
#include "DISPLAY.H"
#include "FILE.H"
#include "TWOGUN.H"

struct dinfo_head
{
	float z;
	short texattr;
	short tile_and_flag;
	short num_verts;
	short e4b100;
};
struct dinfo_line // size 92
{
	dinfo_head head;
	D3DTLBUMPVERTEX v1;
	D3DTLBUMPVERTEX v2;
};

struct dinfo_tri // size 132
{
	dinfo_head head;
	D3DTLBUMPVERTEX v1;//12
	D3DTLBUMPVERTEX v2;//52
	D3DTLBUMPVERTEX v3;//92
};

struct dinfo_quad // size 252
{
	dinfo_head head;
	D3DTLBUMPVERTEX v1;//12
	D3DTLBUMPVERTEX v2;//52
	D3DTLBUMPVERTEX v3;//92
	D3DTLBUMPVERTEX v1bis;//132
	D3DTLBUMPVERTEX v3bis;//172
	D3DTLBUMPVERTEX v4;//212
};

HRESULT(*DrawPrimitive)(D3DPRIMITIVETYPE dptPrimitiveType, D3DVERTEXTYPE dvtVertexType,
	LPVOID lpvVertices, DWORD dwVertexCount, DWORD dwFlags);
HRESULT(*BeginScene)();
HRESULT(*EndScene)();
HRESULT(*SetRenderState)(D3DRENDERSTATETYPE dwRenderStateType, DWORD dwRenderState);
bool(*PtrVisible)(D3DTLVERTEX *v1, D3DTLVERTEX *v2, D3DTLVERTEX *v3);
void(*AddQuad1)(D3DTLVERTEX *v, int v1, int v2, int v3, int v4, OBJECT_TEXTURE* tex, int a7);
void(*AddQuad2)(D3DTLVERTEX *v, int v1, int v2, int v3, int v4, OBJECT_TEXTURE* tex, int a7);
void(*AddTri1)(D3DTLVERTEX *v, int v1, int v2, int v3, OBJECT_TEXTURE* tex, int a7);
void(*AddTri2)(D3DTLVERTEX *v, int v1, int v2, int v3, OBJECT_TEXTURE* tex, int a7);
void(*AddLine)(D3DTLVERTEX *v1, D3DTLVERTEX *v2, short color);

DXTEXTURE DXTextureList[MAX_D3D_TEXTURES];

uint32_t global_ambient;

float fog_start = SECTOR(12);
float fog_end = SECTOR(20);

int num_fog_bulbs;

int num_snow_flakes;
int num_rain_drops;
