#include "NEWINV2.H"

#include "SPECIFIC.H"
#include "LARA.H"
#include "LOADSAVE.H"
#include "OBJECTS.H"
#include "GAMEFLOW.H"
#include "CONTROL.H"
#include "SAVEGAME.H"
#include "CD.H"
#include "LARA2GUN.H"
#include "LARA1GUN.H"
#include INPUT_H
#include "EFFECTS.H"
#include "CAMERA.H"
#ifdef PC_VERSION
#include "GAME.H"
#else
#include "SETUP.H"
#endif

enum invobj_types // update this whenever inventry_objects_list is modified
{
	INV_UZI_ITEM = 0,
	INV_PISTOLS_ITEM = 1,
	INV_SHOTGUN_ITEM = 2,
	INV_REVOLVER_ITEM1 = 3,
	INV_REVOLVER_ITEM2 = 4,
	INV_CROSSBOW_AMMO2_ITEM1 = 5,
	INV_CROSSBOW_AMMO2_ITEM2 = 6,
	INV_HK_ITEM1 = 7,
	INV_HK_ITEM2 = 8,
	INV_SHOTGUN_AMMO1_ITEM = 9,
	INV_SHOTGUN_AMMO2_ITEM = 10,
	INV_HK_AMMO_ITEM1 = 11,
	INV_HK_AMMO_ITEM2 = 12,
	INV_HK_AMMO_ITEM3 = 13,
	INV_HK_AMMO_ITEM4 = 14,
	INV_CROSSBOW_AMMO2_ITEM3 = 15,
	INV_CROSSBOW_AMMO2_ITEM4 = 16,
	INV_REVOLVER_AMMO_ITEM = 17,
	INV_UZI_AMMO_ITEM = 18,
	INV_PISTOLS_AMMO_ITEM = 19,
	INV_LASERSIGHT_ITEM = 20,
	INV_SILENCER_ITEM = 21,
	INV_BIGMEDI_ITEM = 22,
	INV_SMALLMEDI_ITEM = 23,
	INV_BINOCULARS_ITEM = 24,
	INV_FLARE_INV_ITEM = 25,
	INV_COMPASS_ITEM = 26,
	INV_MEMCARD_LOAD_INV_ITEM = 27,
	INV_MEMCARD_SAVE_INV_ITEM = 28,
	INV_PUZZLE_ITEM1 = 29,
	INV_PUZZLE_ITEM2 = 30,
	INV_PUZZLE_ITEM3 = 31,
	INV_PUZZLE_ITEM4 = 32,
	INV_PUZZLE_ITEM5 = 33,
	INV_PUZZLE_ITEM6 = 34,
	INV_PUZZLE_ITEM7 = 35,
	INV_PUZZLE_ITEM8 = 36,
	INV_PUZZLE_ITEM1_COMBO1 = 37,
	INV_PUZZLE_ITEM1_COMBO2 = 38,
	INV_PUZZLE_ITEM2_COMBO1 = 39,
	INV_PUZZLE_ITEM2_COMBO2 = 40,
	INV_PUZZLE_ITEM3_COMBO1 = 41,
	INV_PUZZLE_ITEM3_COMBO2 = 42,
	INV_PUZZLE_ITEM4_COMBO1 = 43,
	INV_PUZZLE_ITEM4_COMBO2 = 44,
	INV_PUZZLE_ITEM5_COMBO1 = 45,
	INV_PUZZLE_ITEM5_COMBO2 = 46,
	INV_PUZZLE_ITEM6_COMBO1 = 47,
	INV_PUZZLE_ITEM6_COMBO2 = 48,
	INV_PUZZLE_ITEM7_COMBO1 = 49,
	INV_PUZZLE_ITEM7_COMBO2 = 50,
	INV_PUZZLE_ITEM8_COMBO1 = 51,
	INV_PUZZLE_ITEM8_COMBO2 = 52,
	INV_KEY_ITEM1 = 53,
	INV_KEY_ITEM2 = 54,
	INV_KEY_ITEM3 = 55,
	INV_KEY_ITEM4 = 56,
	INV_KEY_ITEM5 = 57,
	INV_KEY_ITEM6 = 58,
	INV_KEY_ITEM7 = 59,
	INV_KEY_ITEM8 = 60,
	INV_KEY_ITEM1_COMBO1 = 61,
	INV_KEY_ITEM1_COMBO2 = 62,
	INV_KEY_ITEM2_COMBO1 = 63,
	INV_KEY_ITEM2_COMBO2 = 64,
	INV_KEY_ITEM3_COMBO1 = 65,
	INV_KEY_ITEM3_COMBO2 = 66,
	INV_KEY_ITEM4_COMBO1 = 67,
	INV_KEY_ITEM4_COMBO2 = 68,
	INV_KEY_ITEM5_COMBO1 = 69,
	INV_KEY_ITEM5_COMBO2 = 70,
	INV_KEY_ITEM6_COMBO1 = 71,
	INV_KEY_ITEM6_COMBO2 = 72,
	INV_KEY_ITEM7_COMBO1 = 73,
	INV_KEY_ITEM7_COMBO2 = 74,
	INV_KEY_ITEM8_COMBO1 = 75,
	INV_KEY_ITEM8_COMBO2 = 76,
	INV_PICKUP_ITEM1 = 77,
	INV_PICKUP_ITEM2 = 78,
	INV_PICKUP_ITEM3 = 79,
	INV_PICKUP_ITEM4 = 80,
	INV_PICKUP_ITEM1_COMBO1 = 81,
	INV_PICKUP_ITEM1_COMBO2 = 82,
	INV_PICKUP_ITEM2_COMBO1 = 83,
	INV_PICKUP_ITEM2_COMBO2 = 84,
	INV_PICKUP_ITEM3_COMBO1 = 85,
	INV_PICKUP_ITEM3_COMBO2 = 86,
	INV_PICKUP_ITEM4_COMBO1 = 87,
	INV_PICKUP_ITEM4_COMBO2 = 88,
	INV_BURNING_TORCH_ITEM = 89,
	INV_CROWBAR_ITEM = 90,
	INV_EXAMINE1 = 91,
	INV_EXAMINE2 = 92,
	INV_EXAMINE3 = 93,
	INV_WET_CLOTH = 94,
	INV_CROSSBOW_ITEM = 95,
	INV_CROSSBOW_AMMO1_ITEM = 96,
	INV_CLOTH = 97,
	INV_BOTTLE = 98,
	INV_PUZZLE_HOLE8 = 99,

	NUM_INV_OBJECTS
};

struct INVOBJ inventry_objects_list[NUM_INV_OBJECTS] = // offset 0x92BE8
{
	{ UZI_ITEM, -4, 1000, ANGLE(90), ANGLE(135), ANGLE(90), 2, 81, -1 },
	{ PISTOLS_ITEM, 6, 1000, ANGLE(90), -21172, -17088, 2, 82, -1 },
	{ SHOTGUN_ITEM, -6, 640, ANGLE(-180), ANGLE(-90), ANGLE(45), 2, 83, 1 },
	{ REVOLVER_ITEM, 0, 800, ANGLE(90), ANGLE(60), 15298, 2, 84, 1 },
	{ REVOLVER_ITEM, 0, 800, ANGLE(90), ANGLE(60), 15298, 2, 85, 7 },
	{ CROSSBOW_AMMO2_ITEM, 0, 1100, ANGLE(90), ANGLE(-22.5), ANGLE(0), 2, 77, -1 },
	{ CROSSBOW_AMMO2_ITEM, 0, 1100, ANGLE(90), ANGLE(-22.5), ANGLE(0), 2, 77, -1 },
	{ HK_ITEM, 0, 800, ANGLE(0), ANGLE(-90), ANGLE(0), 2, 89, 1 },
	{ HK_ITEM, 0, 800, ANGLE(0), ANGLE(-90), ANGLE(0), 2, 90, -1 },
	{ SHOTGUN_AMMO1_ITEM, 0, 500, ANGLE(90), ANGLE(0), ANGLE(0), 2, 91, -1 },
	{ SHOTGUN_AMMO2_ITEM, 0, 500, ANGLE(90), ANGLE(0), ANGLE(0), 2, 92, -1 },
	{ HK_AMMO_ITEM, 3, 800, ANGLE(90), ANGLE(0), ANGLE(0), 2, 93, 2 },
	{ HK_AMMO_ITEM, 3, 800, ANGLE(90), ANGLE(0), ANGLE(0), 2, 94, 4 },
	{ HK_AMMO_ITEM, 3, 800, ANGLE(90), ANGLE(0), ANGLE(0), 2, 95, 8 },
	{ HK_AMMO_ITEM, 3, 800, ANGLE(90), ANGLE(0), ANGLE(0), 2, 96, 1 },
	{ CROSSBOW_AMMO2_ITEM, 0, 1100, ANGLE(90), ANGLE(-22.5), ANGLE(0), 2, 77, -1 },
	{ CROSSBOW_AMMO2_ITEM, 0, 1100, ANGLE(90), ANGLE(-22.5), ANGLE(0), 2, 77, -1 },
	{ REVOLVER_AMMO_ITEM, 0, 700, ANGLE(90), -3000, ANGLE(0), 2, 97, -1 },
	{ UZI_AMMO_ITEM, 5, 700, ANGLE(0), 5384, ANGLE(0), 2, 98, -1 },
	{ PISTOLS_AMMO_ITEM, 4, 700, ANGLE(0), ANGLE(90), ANGLE(0), 2, 99, -1 },
	{ LASERSIGHT_ITEM, 2, 700, ANGLE(90), 2000, ANGLE(0), 2, 100, -1 },
	{ SILENCER_ITEM, 1, 900, ANGLE(0), 2000, ANGLE(0), 2, 101, -1 },
	{ BIGMEDI_ITEM, 2, 800, ANGLE(0), ANGLE(0), ANGLE(0), 2, 102, -1 },
	{ SMALLMEDI_ITEM, 0, 512, ANGLE(0), ANGLE(112.5), ANGLE(0), 2, 103, -1 },
	{ BINOCULARS_ITEM, -1, 700, ANGLE(22.5), 2000, ANGLE(0), 2, 104, -1 },
	{ FLARE_INV_ITEM, 2, 1100, ANGLE(90), ANGLE(0), ANGLE(0), 2, 106, -1 },
	{ COMPASS_ITEM, 2, 1100, ANGLE(-180), ANGLE(0), ANGLE(0), 2, 107, -1 },
	{ MEMCARD_LOAD_INV_ITEM, 2, 4000, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ MEMCARD_SAVE_INV_ITEM, 2, 4000, ANGLE(0), ANGLE(0), ANGLE(0), 2, 109, -1 },
	{ PUZZLE_ITEM1, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM2, 14, 600, ANGLE(0), ANGLE(-90), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM3, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM4, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM5, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM6, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM7, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM8, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM1_COMBO1, 18, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM1_COMBO2, 18, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM2_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM2_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM3_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM3_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM4_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM4_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM5_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM5_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM6_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM6_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM7_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM7_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM8_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PUZZLE_ITEM8_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM1, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM3, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM4, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM5, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM6, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM7, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM8, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM1_COMBO1, 18, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM1_COMBO2, 18, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM2_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM2_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM3_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM3_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM4_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM4_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM5_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM5_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM6_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM6_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM7_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM7_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM8_COMBO1, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ KEY_ITEM8_COMBO2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM1, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM2, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM3, 8, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM4, 2, 800, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM1_COMBO1, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM1_COMBO2, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM2_COMBO1, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM2_COMBO2, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM3_COMBO1, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM3_COMBO2, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM4_COMBO1, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ PICKUP_ITEM4_COMBO2, 14, 1200, ANGLE(0), ANGLE(0), ANGLE(0), 2, 108, -1 },
	{ BURNING_TORCH_ITEM, 14, 1200, ANGLE(0), ANGLE(90), ANGLE(0), 2, 108, -1 },
	{ CROWBAR_ITEM, 4, 1900, ANGLE(0), ANGLE(90), ANGLE(0), 2, 110, -1 },
	{ EXAMINE1, 4, 1300, ANGLE(0), ANGLE(90), ANGLE(0), 2, 108, -1 },
	{ EXAMINE2, 14, 1200, ANGLE(0), ANGLE(90), ANGLE(0), 2, 108, -1 },
	{ EXAMINE3, 14, 1200, ANGLE(0), ANGLE(90), ANGLE(0), 2, 108, -1 },
	{ WET_CLOTH, -12, 512, ANGLE(90), ANGLE(67.5), ANGLE(112.5), 2, 78, -1 },
	{ CROSSBOW_ITEM, 0, 900, ANGLE(45), 6144, ANGLE(0), 2, 76, 1 },
	{ CROSSBOW_AMMO1_ITEM, 0, 1100, ANGLE(90), ANGLE(-22.5), ANGLE(0), 2, 77, -1 },
	{ CLOTH, -12, 512, ANGLE(90), ANGLE(67.5), ANGLE(112.5), 2, 79, -1 },
	{ BOTTLE, 18, 800, ANGLE(-90), ANGLE(0), ANGLE(0), 2, 80, -1 },
	{ PUZZLE_HOLE8, -10, 384, ANGLE(-90), 26624, ANGLE(-90), 10, 80, -1 },
};
unsigned char wanky_secrets_table[18] = // offset 0x92BD4
{
	0x00, 0x03, 0x03, 0x03, 0x03, 0x03, 0x01, 0x02, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03, 0x03
};
short options_table[99] = // offset 0x933B8
{
	0x020A, 0x040A, 0x004A, 0x080A, 0x0812, 0x008A, 0x0092, 0x010A, 0x0112, 0x0004, 
	0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 
	0x000C, 0x000C, 0x0004, 0x0004, 0x0004, 0x0004, 0x8000, 0x1000, 0x2000, 0x0004, 
	0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x000C, 0x000C, 0x000C, 
	0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 
	0x000C, 0x000C, 0x000C, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 0x0004, 
	0x0004, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 
	0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x0004, 0x0004, 0x0004, 
	0x0004, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x000C, 0x0004,
	0x0004, 0x0020, 0x0020, 0x0020, 0x0004, 0x4002, 0x0004, 0x000C, 0x000C
};

short optmessages[11] = // offset 0x93480
{
	0x003B, 0x003C, 0x003E, 0x003F, 0x0040, 0x0041, 0x0042, 0x0043, 0x0044, 0x00B2, 0x003D
};

struct COMBINELIST dels_handy_combine_table[24] = // offset 0x93498
{
	{ combine_revolver_lasersight, 3, 0x14, 4 },
	{ combine_crossbow_lasersight, 5, 0x14, 6 },
	{ combine_HK_SILENCER, 7, 0x15, 8 },
	{ combine_PuzzleItem1, 0x25, 0x26, 0x1D },
	{ combine_PuzzleItem2, 0x27, 0x28, 0x1E },
	{ combine_PuzzleItem3, 0x29, 0x2A, 0x1F },
	{ combine_PuzzleItem4, 0x2B, 0x2C, 0x20 },
	{ combine_PuzzleItem5, 0x2D, 0x2E, 0x21 },
	{ combine_PuzzleItem6, 0x2F, 0x30, 0x22 },
	{ combine_PuzzleItem7, 0x31, 0x32, 0x23 },
	{ combine_PuzzleItem8, 0x33, 0x34, 0x24 },
	{ combine_KeyItem1, 0x3D, 0x3E, 0x35 },
	{ combine_KeyItem2, 0x3F, 0x40, 0x36 },
	{ combine_KeyItem3, 0x41, 0x42, 0x37 },
	{ combine_KeyItem4, 0x43, 0x44, 0x38 },
	{ combine_KeyItem5, 0x45, 0x46, 0x39 },
	{ combine_KeyItem6, 0x47, 0x48, 0x3A },
	{ combine_KeyItem7, 0x49, 0x4A, 0x3B },
	{ combine_KeyItem8, 0x4B, 0x4C, 0x3C },
	{ combine_PickupItem1, 0x51, 0x52, 0x4D },
	{ combine_PickupItem2, 0x53, 0x54, 0x4E },
	{ combine_PickupItem3, 0x55, 0x56, 0x4F },
	{ combine_PickupItem4, 0x57, 0x58, 0x50 },
	{ combine_clothbottle, 0x61, 0x62, 0x5E }
};

int GLOBAL_enterinventory = -1; // offset 0xA0B30
int GLOBAL_inventoryitemchosen; // offset 0xA0B34
int GLOBAL_lastinvitem; // offset 0xA0B2C
short examine_mode; // offset 0xA0B28
short stats_mode; // offset 0xA0B2A
int GLOBAL_invkeypadmode; // offset 0xA0B38
int GLOBAL_invkeypadcombination; // offset 0xA0B3C
unsigned char keypadx; // offset 0xA0B40
unsigned char keypady; // offset 0xA0B41
unsigned char keypadnuminputs; // offset 0xA0B42
unsigned char keypadpause; // offset 0xA0B43
short inventry_xpos; // offset 0xA0B44
short inventry_ypos; // offset 0xA0B46
unsigned char keypadinputs[4]; // offset 0xA3780
short ammo_selector_fade_val; // offset 0xA3710
short ammo_selector_fade_dir; // offset 0xA371C
short combine_ring_fade_val; // offset 0xA370C
short combine_ring_fade_dir; // offset 0xA3718
short normal_ring_fade_val; // offset 0xA3708
short normal_ring_fade_dir; // offset 0xA3714
char seperate_type_flag; // offset 0xA3738
char combine_type_flag; // offset 0xA373C
short combine_obj1; // offset 0xA3720
short combine_obj2; // offset 0xA3724
char menu_active; // offset 0xA36F0
struct RINGME* rings[2]; // offset 0xA372C
char loading_or_saving; // offset 0xA3778
char use_the_bitch; // offset 0xA36FC
unsigned char left_debounce; // offset 0xA3760
unsigned char right_debounce; // offset 0xA376C
unsigned char up_debounce; // offset 0xA3768
unsigned char down_debounce; // offset 0xA3764
unsigned char select_debounce; // offset 0xA375C
unsigned char deselect_debounce; // offset 0xA3770
unsigned char go_left; // offset 0xA36F8
unsigned char go_right; // offset 0xA36D8
unsigned char go_up; // offset 0xA3704
unsigned char go_down; // offset 0xA36F4
unsigned char left_repeat; // offset 0xA36E8
unsigned char right_repeat; // offset 0xA36EC
unsigned char go_select; // offset 0xA3734
unsigned char go_deselect; // offset 0xA379C
unsigned char ammo_active; // offset 0xA377C
char bullshitbollox; // offset 0xA37A4
char _bullshitbollox; // offset 0xA37A0
static unsigned short AmountShotGunAmmo1; // offset 0xA36B8
static unsigned short AmountShotGunAmmo2; // offset 0xA36BA
static unsigned short AmountHKAmmo1; // offset 0xA36BC
static unsigned short AmountCrossBowAmmo1; // offset 0xA36BE
static unsigned short AmountCrossBowAmmo2; // offset 0xA36C0
static unsigned short AmountUziAmmo; // offset 0xA36C2
static unsigned short AmountRevolverAmmo; // offset 0xA36C4
static unsigned short AmountPistolsAmmo; // offset 0xA36C6
static char CurrentPistolsAmmoType; // offset 0xA36C8
static char CurrentUziAmmoType; // offset 0xA36C9
static char CurrentRevolverAmmoType; // offset 0xA36CA
static char CurrentShotGunAmmoType; // offset 0xA36CB
static char CurrentGrenadeGunAmmoType; // offset 0xA36CC
static char CurrentCrossBowAmmoType; // offset 0xA36CD
static char StashedCurrentPistolsAmmoType; // offset 0xA36CE
static char StashedCurrentUziAmmoType; // offset 0xA36CF
static char StashedCurrentRevolverAmmoType; // offset 0xA36D0
static char StashedCurrentShotGunAmmoType; // offset 0xA36D1
static char StashedCurrentGrenadeGunAmmoType; // offset 0xA36D2
static char StashedCurrentCrossBowAmmoType; // offset 0xA36D3
char current_selected_option; // offset 0xA36E0
char Stashedcurrent_selected_option; // offset 0xA36DC
struct AMMOLIST ammo_object_list[3]; // offset 0xA3784
char ammo_selector_flag; // offset 0xA3728
char num_ammo_slots; // offset 0xA3758
char* current_ammo_type; // offset 0xA3700
int OBJLIST_SPACING; // offset 0xA3798
char friggrimmer; // offset 0xA36D4
char friggrimmer2; // offset 0xA36E4
char oldLaraBusy; // offset 0xA3774
struct MENUTHANG current_options[3]; // offset 0xA3740

void do_playstation_button_prompts_v1()//416E0, 41B34
{
	if (examine_mode)
	{
		auto i = rings[0]->current_object_list[rings[0]->curobjinlist].invitem;
		// to be continued
	}
	else
	{
		if (stats_mode)
		{
			
		}
		else
		{
			if (ammo_active)
			{
				
			}
			else
			{
				if (GLOBAL_invkeypadmode)
				{
					
				}
				else
				{
					if(rings[1]->ringactive)
					{
						
					}
				}
			}
		}
	}
	S_Warn("[do_playstation_button_prompts_v1] - Unimplemented!\n");
}

void S_DrawPickup(short object_number)//41608, 41A5C
{
	S_Warn("[S_DrawPickup] - Unimplemented!\n");
}

void dels_give_lara_guns_cheat()//41470, 418C4 (F)
{
#if PC_VERSION
	; // null sub
#else
	if(objects[FLARE_INV_ITEM].loaded)
	{
		lara.num_flares = -1;
	}

	lara.num_small_medipack = -1;
	lara.num_large_medipack = -1;

	if (!(gfLevelFlags & GF_LVOP_YOUNG_LARA))
	{
		if (objects[PISTOLS_ITEM].loaded)
		{
			lara.num_shotgun_ammo1 = -1;
